app/controllers/api/v1/students_controller.rb

INSERT INTO `students` (`firstName`, `lastName`, `created_at`, `updated_at`, `teacher_id`) VALUES ('Jason', 'Amazon', '2019-02-09 11:28:33', '2019-02-09 11:28:33', 1)
---
			def create
				@student = Student.new(student_params)

				if @student.save

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 5 LIMIT 1
UPDATE `students` SET `firstName` = 'Jason', `lastName` = 'Amazon', `updated_at` = '2019-02-09 11:42:22' WHERE `students`.`id` = 5
---
			def update
				@student = Student.find(params[:id])

				if @student.update_attributes(student_params)

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 5 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 5
---
			def destroy
				@student = Student.find(params[:id])

				if @student.destroy

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
			def singleStd
				@singleStd = Student.find(params[:id])