app/controllers/finances_controller.rb

  def create
    @finance = Finance.new(finance_params)

    respond_to do |format|
      if @finance.save
---
INSERT INTO `finances` (`Receipt`, `created_at`, `updated_at`, `student_id`) VALUES ('tution', '2019-02-06 09:13:16', '2019-02-06 09:13:16', 1)

    def set_finance
      @finance = Finance.find(params[:id])
---
SELECT  `finances`.* FROM `finances` WHERE `finances`.`id` = 1 LIMIT 1