app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`firstName`, `lastName`, `created_at`, `updated_at`, `teacher_id`) VALUES ('Sean', 'Kimtai', '2019-02-09 11:24:33', '2019-02-09 11:24:33', 1)

    def set_student
      @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1